---
title: PrintParameters
classe: Autodesk.Revit.DB.PrintParameters
namespace: Autodesk.Revit.DB
eredita: Autodesk.Revit.DB.APIObject
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 21
---

# PrintParameters

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `ColorDepthType ColorDepth { get; set; }` | `printParameters.ColorDepth` | ColorDepthType |
| `HiddenLineViewsType HiddenLineViews { get; set; }` | `printParameters.HiddenLineViews` | HiddenLineViewsType |
| `Boolean HideCropBoundaries { get; set; }` | `printParameters.HideCropBoundaries` | Boolean |
| `Boolean HideReforWorkPlanes { get; set; }` | `printParameters.HideReforWorkPlanes` | Boolean |
| `Boolean HideScopeBoxes { get; set; }` | `printParameters.HideScopeBoxes` | Boolean |
| `Boolean HideUnreferencedViewTags { get; set; }` | `printParameters.HideUnreferencedViewTags` | Boolean |
| `MarginType MarginType { get; set; }` | `printParameters.MarginType` | MarginType |
| `Boolean MaskCoincidentLines { get; set; }` | `printParameters.MaskCoincidentLines` | Boolean |
| `Double OriginOffsetX { get; set; }` | `printParameters.OriginOffsetX` | Double |
| `Double OriginOffsetY { get; set; }` | `printParameters.OriginOffsetY` | Double |
| `PageOrientationType PageOrientation { get; set; }` | `printParameters.PageOrientation` | PageOrientationType |
| `PaperPlacementType PaperPlacement { get; set; }` | `printParameters.PaperPlacement` | PaperPlacementType |
| `PaperSize PaperSize { get; set; }` | `printParameters.PaperSize` | PaperSize |
| `PaperSource PaperSource { get; set; }` | `printParameters.PaperSource` | PaperSource |
| `RasterQualityType RasterQuality { get; set; }` | `printParameters.RasterQuality` | RasterQualityType |
| `Boolean ReplaceHalftoneWithThinLines { get; set; }` | `printParameters.ReplaceHalftoneWithThinLines` | Boolean |
| `Double UserDefinedMarginX { get; set; }` | `printParameters.UserDefinedMarginX` | Double |
| `Double UserDefinedMarginY { get; set; }` | `printParameters.UserDefinedMarginY` | Double |
| `Boolean ViewLinksinBlue { get; set; }` | `printParameters.ViewLinksinBlue` | Boolean |
| `Int32 Zoom { get; set; }` | `printParameters.Zoom` | Int32 |
| `ZoomType ZoomType { get; set; }` | `printParameters.ZoomType` | ZoomType |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```